app/controllers/admin_controller.rb

  def dashboard
    @products = Product.all
    @categories = Category.all
---
SELECT * FROM "products"
SELECT * FROM "categories"