app/controllers/categories_controller.rb

SELECT * FROM "categories"
---
  def index
    @categories = Category.all

SELECT * FROM "categories" WHERE ("categories"."id" = 1)
---
  def show
    @category = Category.find(params[:id])

SELECT * FROM "categories" WHERE ("categories"."id" = 2)
---
  def edit
    @category = Category.find(params[:id])

INSERT INTO "categories" ("name", "updated_at", "title", "description", "created_at") VALUES('Somethings', '2009-05-21 05:03:11', 'Crazy! What we think sometimes.', 'This is a description. Can you dig it?', '2009-05-21 05:03:11')
---
  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save

SELECT * FROM "categories" WHERE ("categories"."id" = 1)
UPDATE "categories" SET "title" = 'This is a test of my strength and overall ability.', "description" = 'This is a test.', "updated_at" = '2009-05-21 04:55:38' WHERE "id" = 1
---
  def update
    @category = Category.find(params[:id])

    respond_to do |format|
      if @category.update_attributes(params[:category])

SELECT * FROM "categories" WHERE ("categories"."id" = 5)
DELETE FROM "categories" WHERE "id" = 5
---
  def destroy
    @category = Category.find(params[:id])
    @category.destroy