app/controllers/products_controller.rb

SELECT "products".* FROM "products" INNER JOIN "categorizations" ON "products".id = "categorizations".product_id WHERE (("categorizations".category_id = 1))
SELECT count(*) AS count_all FROM "products"
---
  def index
    get_categories
    if @category
      @products = @category.products.paginate :page => params[:page], :per_page => @site_settings.products_per_page

SELECT * FROM "products" WHERE ("products"."id" = 2)
---
  def edit
    @product = Product.find(params[:id])

INSERT INTO "products" ("name", "full_description", "updated_at", "price", "title", "description", "sku", "created_at") VALUES('This is a test.', NULL, '2009-05-19 21:23:50', NULL, '', '', '', '2009-05-19 21:23:50')
---
  def create
    @product = Product.new(params[:product])
    respond_to do |format|
      if @product.save

SELECT * FROM "products" WHERE ("products"."id" = 1)
UPDATE "products" SET "updated_at" = '2009-05-19 23:36:36', "full_description" = 'This ASU throwback baseball jersey pays homage to former ASU Sun Devil and the 2008 AL MVP Dustin Pedroia! The jersey is 100% polyester and features tackle twill embroidery. The 2007 AL Rookie of the year wore #2 while with the Sun Devils and now you can too! Cactus Sports is independently owned and alumni operated' WHERE "id" = 1
---
  def update
    @product = Product.find(params[:id])
    respond_to do |format|
      if @product.update_attributes(params[:product])

SELECT * FROM "products" WHERE ("products"."id" = 1)
---
  def remove_category
    @product = Product.find(params[:product_id])

SELECT * FROM "products" WHERE ("products"."id" = 2)
---
  def add_category
    @product = Product.find(params[:product_id])